app/controllers/registrations_controller.rb

  def index
    @registrations = Registration.all
---
SELECT `registrations`.* FROM `registrations`

  def create
    @registration = Registration.new(registration_params)

    respond_to do |format|
      if @registration.save
---
INSERT INTO `registrations` (`firstname`, `lastname`, `email`, `phone`, `gender`, `created_at`, `updated_at`) VALUES ('rk', 'krk', 'djfndv@evnv.com', 1234, 'm', '2016-06-15 10:15:39', '2016-06-15 10:15:39')

  def update
    respond_to do |format|
      if @registration.update(registration_params)
---
UPDATE `registrations` SET `lastname` = 'krishna', `email` = 'rk@gmail.com', `phone` = 90009, `gender` = 'm', `updated_at` = '2016-06-15 09:03:15' WHERE `registrations`.`id` = 1

    def set_registration
      @registration = Registration.find(params[:id])
---
SELECT  `registrations`.* FROM `registrations` WHERE `registrations`.`id` = 1 LIMIT 1